Repository: soleribbon/Simple-Voice-Calculator
Catalog: *.lproj/Localizable.strings
Languages: de, es, hi, it, ko

source: TOTAL:
de: GESAMT:
hi: कुल:
it: TOTALE:
ko: 합계:

source: Enter equation
de: Gleichung eingeben
es: Ingresar ecuación
hi: समीकरण दर्ज करें
it: Inserisci equazione
ko: 방정식 입력

source: Input Equation
de: Gleichung eingeben
es: Ecuación de entrada
hi: समीकरण दर्ज करें
it: Equazione di ingresso
ko: 방정식 입력

source: Voice Input
de: Spracheingabe
es: Entrada de voz
hi: ध्वनि प्रविष्टि
it: Inserimento vocale
ko: 음성 입력

source: + Insert
de: + Einfügen
es: + Insertar
hi: + डालें
it: + Inserisci
ko: + 삽입

source: - Insert
de: - Einfügen
es: - Insertar
hi: - डालें
it: - Inserisci
ko: - 삽입

source: × Insert
de: × Einfügen
es: × Insertar
hi: × डालें
it: × Inserisci
ko: × 삽입

source: ÷ Insert
de: ÷ Einfügen
es: ÷ Insertar
hi: ÷ डालें
it: ÷ Inserisci
ko: ÷ 삽입

source: Sym
es: Símb
hi: चिह्न
it: Sim
ko: 기호

source: Clear
es: Borrar
hi: साफ करें
ko: 지우기

source: Start Talking
de: Sprechen beginnen
es: Comenzar a hablar
hi: बात करना शुरू करें
it: Inizia a parlare
ko: 말하기 시작

source: Stop Talking
de: Sprechen beenden
es: Dejar de hablar
hi: बात करना बंद करें
it: Smetti di parlare
ko: 말하기 중지

source: Equation Components
de: Gleichungskomponenten
es: Componentes de la ecuación
hi: समीकरण घटक
it: Componenti dell'equazione
ko: 방정식 구성 요소

source: Introduction Tutorial
de: Einführungstutorial
es: Tutorial de introducción
hi: परिचय ट्यूटोरियल
it: Tutorial introduttivo
ko: 소개 튜토리얼

source: Quick Help
de: Schnelle Hilfe
es: Ayuda rápida
hi: त्वरित सहायता
it: Aiuto rapido
ko: 빠른 도움말

source: About & Contact
de: Geschichte & Kontakt
es: Acerca de & Contacto
hi: के बारे में और संपर्क
it: Informazioni & Contatti
ko: 소개 및 연락처

source: About Simple Voice Calculator
de: Über Simple Voice Calculator
es: Acerca de Simple Voice Calculator
hi: सरल ध्वनि कैलक्यूलेटर के बारे में
it: Informazioni su Simple Voice Calculator
ko: 간단한 음성 계산기 소개

source: Contact Developer
de: Entwickler kontaktieren
es: Contactar al desarrollador
hi: डेवलपर से संपर्क करें
it: Contatta lo sviluppatore
ko: 개발자 연락처

source: Tip Developer a Coffee
es: Invitar un Café al Desarrollador
hi: डेवलपर को एक कॉफी के लिए टिप दें
ko: 개발자에게 커피 팁을 주세요

source: Simple Voice Calculator was made by students.
de: Simple Voice Calculator wurde von Studenten entwickelt.
es: Simple Voice Calculator fue creada por estudiantes.
hi: सरल ध्वनि कैलक्यूलेटर को छात्रों ने बनाया है।
it: Simple Voice Calculator è stata realizzata da studenti.
ko: 간단한 음성 계산기는 학생들이 만들었습니다.

source: Privacy
de: Datenschutz
es: Privacidad
hi: गोपनीयता
ko: 개인정보 보호

source: Version
es: Versión
hi: संस्करण
it: Versione
ko: 버전

source: Cup
de: Tasse
es: Taza
hi: कप
it: Tazza
ko: 컵

source: Cups
de: Tassen
es: Tazas
hi: कप
it: Tazze
ko: 컵들

source: **What math operators are supported?**
de: **Welche mathematischen Operatoren werden unterstützt?**
es: **¿Qué operadores matemáticos son compatibles?**
hi: **कौन से गणित ऑपरेटर समर्थित हैं?**
it: **Quali operatori matematici sono supportati?**
ko: **지원하는 수학 연산자는 무엇인가요?**

source: Currently supported operators:
de: Derzeit unterstützte Operatoren:
es: Operadores actualmente compatibles:
hi: वर्तमान में समर्थित ऑपरेटर:
it: Operatori attualmente supportati:
ko: 현재 지원되는 연산자:

source: Invalid Equation is presented when the textfield contains characters that are not valid in a mathematical equation or not currently supported.
de: Ungültige Gleichung wird angezeigt, wenn das Textfeld Zeichen enthält, die in einer mathematischen Gleichung nicht gültig sind oder derzeit nicht unterstützt werden.
es: Ecuación no válida se presenta cuando el campo de texto contiene caracteres que no son válidos en una ecuación matemática o no son compatibles actualmente.
hi: अवैध समीकरण प्रस्तुत किया जाता है जब टेक्स्टफ़ील्ड में वैध गणितीय समीकरण या वर्तमान में समर्थित नहीं होने वाले अक्षर होते हैं।
it: Equazione non valida viene mostrato quando il campo di testo contiene caratteri non validi in un'equazione matematica o attualmente non supportati.
ko: 수학적 방정식에서 유효하지 않거나 현재 지원되지 않는 문자가 텍스트 필드에 있을 때 '잘못된 방정식'이 표시됩니다.

source: The Sym button can be used to insert a desired math symbol where your cursor is placed in the textfield.
de: Mit der Sym-Schaltfläche können Sie ein gewünschtes mathematisches Symbol an der Stelle einfügen, an der sich Ihr Cursor im Textfeld befindet.
es: El botón Símb se puede utilizar para insertar un símbolo matemático deseado donde se encuentra el cursor en el campo de texto.
hi: सिम बटन का उपयोग टेक्स्टफ़ील्ड में आपके कर्सर स्थानित होने पर एक चयनित गणितीय प्रतीक डालने के लिए किया जा सकता है।
it: Il pulsante Sim può essere utilizzato per inserire un simbolo matematico desiderato nel punto in cui è posizionato il cursore nel campo di testo.
ko: '기호' 버튼을 사용하여 커서가 위치한 텍스트 필드에 원하는 수학 기호를 삽입할 수 있습니다.

source: You can edit any component of your equation in the 'Equation Components' section. Just tap your desired component and it will be selected in your textfield. Make sure you do not have voice input enabled (button should say 'Start Talking').
es: Puede editar cualquier componente de su ecuación en la sección 'Componentes de la ecuación'. Simplemente toque los componentes deseados y se seleccionarán en su campo de texto. Asegúrese de no tener activada la entrada de voz (el botón debe decir 'Comenzar a hablar').
hi: 'समीकरण घटक' खंड में आप अपने समीकरण के किसी भी घटक को संपादित कर सकते हैं। बस अपने इच्छित घटकों को टैप करें और यह आपके टेक्स्टफ़ील्ड में चयनित हो जाएगा। सुनिश्चित करें कि आपके पास ध्वनि प्रविष्टि सक्षम नहीं है (बटन पर 'बात करना शुरू करें' लिखा होना चाहिए)।
ko: '방정식 구성 요소' 섹션에서 방정식의 모든 구성 요소를 편집할 수 있습니다. 원하는 구성 요소를 탭하면 텍스트 필드에 선택됩니다. 음성 입력이 활성화되어 있지 않아야 합니다 (버튼은 '말하기 시작'이라고 표시되어야 함).

source: In a world forever on the move, the seed of Simple Voice Calculator was planted with the simple goal of making math accessible for everyone, everywhere. We (the creators) saw that some people struggled to type out long equations, while others had difficulty seeing and tapping small numbers on their screens. These observations sparked an idea. We decided to create an app that transcended traditional input methods, one that used the simplicity of human voice to solve equations. Thus, Simple Voice Calculator was born, a testament to human ingenuity and the power of voice. Designed to understand and solve basic equations, it also allows for instant editing, embodying the notion that math is a flexible, living language. This app is not just a tool, but a story of making math simple, accessible, and inclusive.
de: In einer Welt, die sich ständig in Bewegung befindet, wurde der Keim für den Simple Voice Calculator mit dem einfachen Ziel gepflanzt, Mathematik für alle und überall zugänglich zu machen. Wir (die Erfinder) sahen, dass einige Menschen Schwierigkeiten hatten, lange Gleichungen einzugeben, während andere Schwierigkeiten hatten, kleine Zahlen auf ihren Bildschirmen zu sehen und anzutippen. Diese Beobachtungen brachten eine Idee hervor. Wir beschlossen, eine App zu entwickeln, die über traditionelle Eingabemethoden hinausging und die Einfachheit der menschlichen Stimme nutzte, um Gleichungen zu lösen. So entstand der Simple Voice Calculator, ein Zeugnis für menschlichen Einfallsreichtum und die Kraft der Stimme. Entwickelt, um grundlegende Gleichungen zu verstehen und zu lösen, ermöglicht er auch sofortiges Bearbeiten und verkörpert den Gedanken, dass Mathematik eine flexible, lebendige Sprache ist. Diese App ist nicht nur ein Werkzeug, sondern eine Geschichte, die Mathematik einfach, zugänglich und inklusiv macht.
hi: चलती रहने वाली दुनिया में, सरल ध्वनि कैलक्युलेटर के बीज को सभी लोगों के लिए सरल ध्वनि कैलक्युलेटर बनाने के सरल उद्देश्य के साथ रखा गया था। हमने (सिरजनहार) देखा कि कुछ लोग लंबे समीकरण लिखने में संघर्ष करते हैं, जबकि दूसरे लोगों को अपने स्क्रीन पर छोटे नंबरों को देखने और टैप करने में कठिनाई होती है। ये अवलोकन एक विचार को उत्पन्न करते हैं। हमने तय किया कि हम एक एप्लिकेशन बनाएंगे जो पारंपरिक इनपुट विधियों से परे होगा, जो मानवीय ध्वनि के सरलता का उपयोग करके समीकरणों को हल करने के लिए होगा। इस प्रकार, सरल ध्वनि कैलक्युलेटर ने जन-सामर्थ्य और ध्वनि की शक्ति का प्रमाण दिया। मूल्यांकन को समझने और हल करने के लिए डिज़ाइन किए गए यह आवश्यक समीकरणों को तत्पर रखता है, जो गणित को एक लचीली, जीवंत भाषा के रूप में उभारता है। यह एप्लिकेशन सिर्फ एक उपकरण ही नहीं है, बल्कि गणित को सरल, पहुंचने योग्य और समावेशी बनाने की कहानी है।
it: In un mondo in continuo movimento, il seme di Simple Voice Calculator è stato piantato con l'obiettivo semplice di rendere la matematica accessibile a tutti, ovunque. Noi (i creatori) abbiamo notato che alcune persone faticavano a digitare lunghe equazioni, mentre altre avevano difficoltà a vedere e toccare piccoli numeri sui loro schermi. Queste osservazioni hanno fatto scattare un'idea. Abbiamo deciso di creare un'app che superasse i metodi di input tradizionali, una che utilizzasse la semplicità della voce umana per risolvere le equazioni. Così è nata Simple Voice Calculator, un tributo all'ingegno umano e al potere della voce. Progettata per comprendere e risolvere equazioni di base, consente anche la modifica istantanea, incarnando il concetto che la matematica è un linguaggio flessibile e vivo. Questa app non è solo uno strumento, ma una storia di come rendere la matematica semplice, accessibile e inclusiva.
ko: 늘 변화하는 세상에서 간단한 음성 계산기의 씨앗은 모두가 어디서나 수학에 접근할 수 있도록 하는 단순한 목표를 가지고 심어졌습니다. 우리(창조자들)는 일부 사람들이 긴 방정식을 입력하는 데 어려움을 겪고, 다른 일부는 화면에 있는 작은 숫자를 보고 탭하는 데 어려움을 겪는 것을 보았습니다. 이러한 관찰은 아이디어를 불씨를 불러왔습니다. 우리는 전통적인 입력 방법을 초월하는 앱을 만들기로 결정했는데, 그것은 인간의 음성의 단순성을 이용해 방정식을 풀어내는 앱이었습니다. 이렇게 해서 간단한 음성 계산기가 탄생하게 되었는데, 이것은 인간의 창의성과 음성의 힘을 증명하는 것이었습니다. 기본적인 방정식을 이해하고 해결하도록 설계되었으며, 즉각적인 편집을 허용하여 수학이 유연하고 살아있는 언어라는 개념을 구현합니다. 이 앱은 단순히 도구가 아니라, 수학을 단순하고 접근 가능하며 포괄적으로 만드는 이야기입니다.

source: Thank you for your donation!
de: Vielen Dank für Ihre Spende!
es: ¡Gracias por su donación!
hi: आपके दान के लिए धन्यवाद!
it: Grazie per la tua donazione!
ko: 기부에 감사드립니다!

source: Donation failed...
de: Spende fehlgeschlagen...
es: Donación fallida...
hi: दान विफल हो गया...
it: Donazione non riuscita...
ko: 기부 실패...

source: Settings
de: Einstellungen
es: Ajustes
hi: सेटिंग्स
it: Impostazioni
ko: 설정

source: We take privacy so seriously, we do not collect any information at all! Once a calculation is cleared, it is gone forever.
de: Wir nehmen den Datenschutz so ernst, dass wir überhaupt keine Informationen erfassen! Sobald eine Berechnung gelöscht ist, ist sie für immer verschwunden.
hi: हम गोपनीयता को बहुत गंभीरता से लेते हैं, हम किसी भी जानकारी का संग्रह नहीं करते! एक बार एक गणना साफ हो जाती है, वह हमेशा के लिए चली जाती है।
it: Prendiamo la privacy così seriamente che non raccogliamo affatto informazioni! Una volta cancellata un'operazione, è persa per sempre.
ko: 우리는 프라이버시를 매우 심각하게 다룹니다, 우리는 어떤 정보도 수집하지 않습니다! 한 번 계산이 지워지면, 그것은 영원히 사라집니다.

source: *Speech data is sent to Apple to ensure transcription accuracy
de: *Sprachdaten werden an Apple gesendet, um die Transkriptionsgenauigkeit zu gewährleisten
es: *Los datos de voz se envían a Apple para garantizar la precisión de la transcripción
hi: *ट्रांसक्रिप्शन सटीकता सुनिश्चित करने के लिए भाषण डेटा Apple को भेजा जाता है
it: *I dati vocali vengono inviati ad Apple per garantire l'accuratezza della trascrizione
ko: *전사의 정확성을 보장하기 위해 음성 데이터가 Apple로 전송됩니다

source: Welcome to Simple Voice Calculator
de: Willkommen beim Simple Voice Calculator
es: Bienvenido a Simple Voice Calculator
hi: सादा आवाज़ कैलकुलेटर में आपका स्वागत है
it: Benvenuto su Simple Voice Calculator
ko: 간단한 음성 계산기에 오신 것을 환영합니다

source: Quick Setup
de: Schnelleinrichtung
es: Configuración rápida
hi: त्वरित सेटअप
it: Impostazione rapida
ko: 빠른 설정

source: This is where the magic happens.
de: Hier geschieht die Magie.
es: Aquí es donde sucede la magia.
hi: यहाँ जादू होता है।
it: Qui avviene la magia.
ko: 이곳에서 마법이 일어납니다.

source: Continue
de: Weiter
es: Continuar
hi: जारी रखें
it: Continua
ko: 계속

source: Easily edit any component of your equation.
de: Bearbeiten Sie ganz einfach jede Komponente Ihrer Gleichung.
es: Edite fácilmente cualquier componente de su ecuación.
hi: आसानी से अपनी समीकरण के किसी भी घटक को संपादित करें।
it: Modifica facilmente ogni componente della tua equazione.
ko: 방정식의 어떤 구성 요소도 쉽게 편집하세요.

source: 'Invalid Equation' means your input was invalid. Check your equation.
de: 'Ungültige Gleichung' bedeutet, dass Ihre Eingabe ungültig war. Überprüfen Sie Ihre Gleichung.
es: 'Ecuación no válida' significa que su entrada no es válida. Revise su ecuación.
hi: 'अवैध समीकरण' का अर्थ है कि आपका इनपुट अमान्य था। अपने समीकरण की जांच करें।
it: 'Equazione non valida' significa che il tuo input non era valido. Controlla la tua equazione.
ko: '잘못된 방정식'은 입력이 유효하지 않았음을 의미합니다. 방정식을 확인하세요.

source: Help is always available.
de: Hilfe ist immer verfügbar.
es: La ayuda siempre está disponible.
hi: मदद हमेशा उपलब्ध है।
it: L'aiuto è sempre disponibile.
ko: 도움말은 항상 이용 가능합니다.

source: Now, time to calculate.
de: Jetzt ist es Zeit zu rechnen.
es: Ahora, es hora de calcular.
hi: अब, गणना करने का समय है।
it: Ora è il momento di calcolare.
ko: 이제, 계산할 시간입니다.

source: Get Started
de: Los geht's
es: Comenzar
hi: शुरू करें
it: Inizia
ko: 시작하기

source: Skip Introduction
de: Einführung überspringen
es: Omitir introducción
hi: परिचय छोड़ें
it: Salta introduzione
ko: 소개 건너뛰기

source: Important Notes
de: Wichtige Hinweise
es: Notas importantes
hi: महत्वपूर्ण नोट्स
it: Note importanti
ko: 중요한 노트

source: After pressing 'Stop Talking', your dictated equation will be added to the end of the input field.
de: Nachdem Sie 'Sprechen beenden' gedrückt haben, wird Ihre diktierte Gleichung am Ende des Eingabefelds hinzugefügt.
es: Después de presionar 'Dejar de hablar', su ecuación dictada se agregará al final del campo de entrada.
hi: 'बोलना बंद करें' दबाने के बाद, आपके निर्दिष्ट समीकरण को इनपुट फ़ील्ड के अंत में जोड़ा जाएगा।
it: Dopo aver premuto 'Smetti di parlare', l'equazione dettata verrà aggiunta alla fine del campo di input.
ko: '말하기 중지'를 누른 후에는, 말한 방정식이 입력 필드의 끝에 추가됩니다.

source: While voice dictation is enabled, you are unable to manually edit the input field.
de: Während die Sprachdiktierung aktiviert ist, können Sie das Eingabefeld nicht manuell bearbeiten.
es: Mientras la dictación por voz esté habilitada, no podrá editar manualmente el campo de entrada.
hi: जब आवाज़ टाइपिंग सक्षम होती है, तब आप इनपुट फ़ील्ड को मैन्युअल रूप से संपादित नहीं कर सकते हैं।
it: Mentre la dettatura vocale è abilitata, non è possibile modificare manualmente il campo di input.
ko: 음성 인식이 활성화된 동안에는 입력 필드를 수동으로 편집할 수 없습니다.

source: Ensure no alphabetical letters are included in your input.
de: Stellen Sie sicher, dass keine Buchstaben in Ihrer Eingabe enthalten sind.
es: Asegúrese de que no haya letras del alfabeto en su entrada.
hi: अपने इनपुट में कोई भी वर्णमाला के पत्र शामिल न करें।
it: Assicurati che non ci siano lettere dell'alfabeto nel tuo input.
ko: 입력에 알파벳 문자가 포함되지 않도록 하십시오.

source: **What does 'Invalid Equation' mean?**
de: **Was bedeutet 'Ungültige Gleichung'?**
es: **¿Qué significa 'Ecuación no válida'?**
hi: **'अवैध समीकरण' का क्या मतलब है?**
it: **Cosa significa 'Equazione non valida'?**
ko: **'잘못된 방정식'이란 무엇을 의미하나요?**

source: **What does the 'Sym' button do?**
de: **Was bewirkt die 'Sym' Schaltfläche?**
es: **¿Qué hace el botón 'Símb'?**
hi: **'सिम' बटन क्या करता है?**
it: **Cosa fa il pulsante 'Sim'?**
ko: **'기호' 버튼은 무엇을 하나요?**

source: **How do I edit my voice input?**
de: **Wie bearbeite ich meine Spracheingabe?**
es: **¿Cómo edito mi entrada de voz?**
hi: **मैं अपने ध्वनि इनपुट को कैसे संपादित कर सकता हूँ?**
it: **Come modifico l'input vocale?**
ko: **음성 입력을 어떻게 편집하나요?**

source: Only **+ - × ÷** are supported
de: Nur **+ - × ÷** werden unterstützt
es: Solo se admiten **+ - × ÷**
hi: केवल **+ - × ÷** समर्थित हैं
it: Sono supportati solo **+ - × ÷**
ko: **+ - × ÷** 만 지원됩니다

source: Total equals %@
es: El total es %@
hi: कुल योग है %@
ko: 총합은 %@

source: Announce Total
es: Anunciar Total
hi: कुल घोषणा करें
ko: 총액 발표

source: Preferences
es: Preferencias
hi: प्राथमिकताएँ
ko: 환경 설정

source: Clear Equation
es: Borrar ecuación
hi: समीकरण साफ़ करें

source: Tip a Coffee
es: Invitar un café
hi: एक कॉफी टिप करें
